**Отчёт по лабораторной работе №8 по курсу** 

**«Фундаментальная информатика»** 

Студент группы: М80-108Б-22, Старостина Анна Андреевна, № по списку: 20 Контакты: <starostina-anuta@mail.ru> 

Работа выполнена: «8» октября 2022 г. Преподаватель: Сахарин Никита Андреевич Входной контроль знаний с оценкой: 

Отчёт сдан: «9» октября 2022 г. Итоговая оценка: 

Подпись преподавателя:    

1. **Тема:** Системы программирования на языке Си.** 
1. **Цель  работы:**  изучение  конкретной  системы  программирования  на  Си  и получение навыков подготовки текстов и отладки программ.**  
1. **Задание:**  изучение  и  освоение  возможности  лабораторной  работы  СП  по содержащейся  в  практикуме  документации  и  другим  источникам,  в  том  числе основные  этапы  процесса  компиляции  и  подготовки  программ  к  выполнению; составить  и  отладить  простейшую  программу  на  Си  в  терминальном  классе; изучить различные системы программирования на Си на других платформах на домашних компьютерах.** 
1. **Оборудование:**  

**Ноутбук Macbook Pro  Процессор:** apple m2  **Монитор:** 2560х1600 

5. **Программное обеспечение:**  

Операционная система семейства: Linux Ubuntu 22.04.1 Интерпретатор команд: bash 5.0.17(1) 

Система программирования:  

Редактор текстов: emacs 

Утилиты операционной системы: 

Прикладные системы и программы: 

Местонахождение и имена файлов программ и данных: 

6. **Идея, метод, алгоритм решения задачи** 

В  формах:  словесной,  псевдокода,  графической  [блок  схема,  диаграмма,  рисунок, таблица] или формальные спецификации с пред- и постусловиями. 

1. Изучить способы компиляции и подготовки программы к выполнению. 
1. Создать файл (1.c) с простейшей программой (создает массив из 10 ячеек, циклом while  заполняет  каждую  ячейку  7,  в  ответе  должны  выйти  нумерации  ячеек  и  их содержащее), специально допустив ошибку (нет знака нужного знака ; в конце одной строки). 
1. Скомпилировать  программу  (cc  1.c  или  gcc  -std  -Wall  -pedantic  1.c)  ,  увидеть 

ошибку, исправить ее в emacs (emacs 1.c) , опять скомпилировать, запустить (./a.out 1.c) и увидеть нужный ответ. 

**7. Сценарий выполнения работы:** 

[План работы, первоначальный текст программы в черновике ( можно на отдельном листе) и тесты либо соображения по тестированию] 
``` :src/1.c
#include <stdio.h>
#include <stdlib.h>

int main()
{
   int i;
   int mas[10];
   i=0;
   while (i<10)
   {
      mas[i]=7;
      printf("%d = %d\n",i,mas[i]);
      i+=1;
   }
   return 0;
}
Footer
```

8. **Распечатка протокола**  

Подклеить  листинг  окончательного  варианта  программы  с  тестовыми  примерами, подписанный преподавателем. 
```
ann@ann:~$ gcc -std=c99 -Wall -pedantic 1.c 

1.c: In function ‘main’: 

1.c:11:15: error: expected ‘;’ before ‘printf’ 

`   `11 |       mas[i]=7 

`      `|               ^ 

`      `|               ; 

`   `12 |       printf("%d = %d\n",i,mas[i]); 

`      `|       ~~~~~~    

1.c:7:8: warning: variable ‘mas’ set but not used [-Wunused-but-set-variable]     7 |    int mas[10]; 

`      `|        ^~~ 

ann@ann:~$ emacs 1.c 

ann@ann:~$ gcc -std=c99 -Wall -pedantic 1.c 

ann@ann:~$ ./a.out 1.c 

0 = 7 

1 = 7 

2 = 7 

3 = 7 

4 = 7 

5 = 7 

6 = 7 

7 = 7 

8 = 7 

9 = 7 

ann@ann:~$  
```
9. **Дневник отладки** 

Должен  содержать  дату  и  время  сеансов  отладки  и  основные  события  (ошибки  в 

сценарии и программе, нестандартные ситуации) и краткие комментария к ним. В дневнике отладки приводятся сведения об использовании других ЭВМ, существенном участии преподавателя и других лиц в написании отладки программы. 



|**№**|**Лаб. Или дом.**|**Дата**|**Время**|**Событие**|**Действие по направлению**|**Примечание**|
| - | - | - | - | - | - | - |
|1|Дом|09.11|20:00|Сдача лабораторной работы|интернет||


10. **Замечания автора по существу работы:** 
Заданием было написать программу, которая будет перемножать многочлен на одночлен (8.c)
``` :src/8.c
#include <stdio.h>
#include <stddef.h>
#include <assert.h>

void multiply(size_t n, int p[], int m[2]) {
    for (ptrdiff_t i = n; i >= 0; --i) {
        if (i==0) {
            p[i] = m[0] * p[i];
        } else if (i==n) {
            p[i] = m[1] * p[i - 1];
        } else {
            p[i] = m[0] * p[i];
            p[i] += m[1] * p[i - 1];
        }
    }
}

int main(void) {
    int p[4] = { 13, 7, -5 }, m[2] = { 3, -3 };
    multiply(3, p, m);
    assert(
        p[0] == 39 && p[1] == -18 &&
        p[2] == -36 && p[3] == 15
    );
    return 0;
}
```
11. **Выводы:** 

С помощью лабораторной работы были изучены основные способы компиляции и подготовки программы к выполнению, была составлена простейшая программа, были исправлены в ней ошибки, были отработаны эти навыки. 

Недочёты при выполнении задания могут быть выполнены следующим образом: Подпись студета: 
