**Отчёт по лабораторной работе №11 по курсу** 

**«Фундаментальная информатика»** 

Студент группы: М80-108Б-22, Старостина Анна Андреевна, № по списку: 20 Контакты: <starostina-anuta@mail.ru> 

Работа выполнена: «12» ноября 2022 г. Преподаватель: Сахарин Никита Андреевич Входной контроль знаний с оценкой: 

Отчёт сдан: « 12 » ноября 2022 г. Итоговая оценка: 

Подпись преподавателя:    

1. **Тема:**  Обработка  последовательности  литер  входного  текстового  файла. Простейшие приёмы лексического анализа. Диаграммы состояний и переходов. 
1. **Цель работы:** Изучить данную тему и написать программу по своему заданию. 
1. **Задание:** (вариант 20) перевести все мерные расстояния из миль (mi) в километры (km). Например: 1000mi - 1609km 
1. **Оборудование:**  

**Ноутбук Macbook Pro  Процессор:** apple m2  **Монитор:** 2560х1600 

5. **Программное обеспечение:**  

Операционная система семейства: Linux Ubuntu 22.04.1 Интерпретатор команд: bash 5.0.17(1) 

Система программирования:  

Редактор текстов: emacs 

Утилиты операционной системы: команды gcc Прикладные системы и программы: 

Местонахождение и имена файлов программ и данных: 

6. **Идея, метод, алгоритм решения задачи** 

В  формах:  словесной,  псевдокода,  графической  [блок  схема,  диаграмма,  рисунок, таблица] или формальные спецификации с пред- и постусловиями. 

1. За основу нужно взять конструкцию структур (у меня 5 состояний: OUT (если вне числа), IN\_DIGIT(в нужном числе), CONTINUE(то, что нам не подходит, то есть это просто нужно вывести), IN\_MAYBE\_MILE(если встречаются цифры, а потом m, то переходим в следующее состояние, потому что, возможно, это то, что нам нужно), IN\_MILE(используем функцию перевода из миль в километры) ). 
1. Отдельно напишем функцию перевода и округления (из миль в км). 
1. Функцией  с=getchar()  будем  считывать  один  символ  и  накапливать  его  в переменной n, если он будет нам подходить. Если не подходит, то сразу печатаем его. 
7. **Сценарий выполнения работы:** 

[План работы, первоначальный текст программы в черновике ( можно на отдельном листе) и тесты либо соображения по тестированию] 

1.Была изучена теория по структурам в языке Си 

2.Была написана программа (111.с) и туда запущены примеры из другого файла (о.с) 3.Написание отчёта* 

8. **Распечатка протокола**  

Подклеить  листинг  окончательного  варианта  программы  с  тестовыми  примерами, подписанный преподавателем. 

ann@ann:~$ cat 111.c #include <stdio.h> #include <ctype.h> #include <math.h> 

int to\_km (int mi) {  

`    `int i = 0; 

`    `i = round(mi \* 1.609);     return i; 

} 

typedef enum { 

`    `OUT, 

`    `IN\_DIGIT, 

`    `CONTINUE, 

`    `IN\_MAYBE\_MILE,     IN\_MILE 

} state; 

int main() { 

`    `state state = OUT; 

`    `int n = 0; 

`    `for (int c = getchar(); c != EOF; c = getchar()) {         switch (state){ 

`            `case OUT: 

`                `if (isdigit(c)){ 

`                    `state = IN\_DIGIT; 

`                    `n += (c - '0'); 

`                `} else if ((c == ' ') || (c == '\n')) { 

`                    `putchar(c); 

`                `} else { 

`                    `putchar(c); 

`                    `state = CONTINUE; 

`                `} 

`                `break; 

`            `case IN\_DIGIT: 

`                `if(isdigit(c)) { 

`                    `n = n \* 10 + (c - '0'); 

`                `} else if(c == 'm') { 

`                    `state = IN\_MAYBE\_MILE; 

`                `} else if((c == ' ') || (c == '\n')) { 

`                    `printf("%d%c", n, c); 

`                    `n = 0; 

`                    `state = OUT; 

`                `} else { 

`                    `state = CONTINUE; 

`                    `printf("%d", n); 

`                    `n = 0; 

`                    `putchar(c); 

`                `} 

`                `break; 

`            `case CONTINUE: 

`                `if ((c == ' ') || (c == '\n')) { 

`                    `putchar(c); 

`                    `state = OUT; 

`                `} else { 

`                    `putchar(c); 

`                `} 

`                `break; 

`            `case IN\_MAYBE\_MILE: 

`                `if (c == 'i') { 

`                    `state = IN\_MILE; 

`                `} else if((c == ' ') || (c == '\n')) { 

`                    `printf("%dm%c", n, c); 

`                    `n = 0; 

`                    `state = OUT; 

`                `} else { 

`                    `printf("%dm", n); 

`                    `n = 0; 

`                    `putchar(c); 

`                    `state = CONTINUE; 

`                `} 

`                `break; 

`            `case IN\_MILE: 

`                `if((c == ' ') || (c == '\n')) { 

`                    `printf("%dkm%c", to\_km(n), c);                     n = 0; 

`                    `state = OUT; 

`                `} else { 

`                    `state = CONTINUE;                     printf("%dmi", n); 

`                    `n = 0; 

`                    `putchar(c); 

`                `} 

`                `break; 

`        `} 

`    `} 

`    `return 0; 

} 

ann@ann:~$ cat o.c 

123456mi 567 dfghjfgh 8mimi 678mimimi 123474mi fgvbndf 56mi $%&% % ki 9mi 21kilom 0mi -9mi ann@ann:~$ gcc -std=c99 -Wall -pedantic 111.c -lm ann@ann:~$ ./a.out < o.c 

198641km 567 dfghjfgh 8mimi 678mimimi 198670km fgvbndf 90km $%&% % ki 14km 21kilom 0km -9mi ann@ann:~$ 

9. **Дневник отладки** 

Должен  содержать  дату  и  время  сеансов  отладки  и  основные  события  (ошибки  в сценарии и программе, нестандартные ситуации) и краткие комментария к ним. В дневнике отладки приводятся сведения об использовании других ЭВМ, существенном участии преподавателя и других лиц в написании отладки программы. 



|**№**|**Лаб. Или дом.**|**Дата**|**Время**|**Событие**|**Действие по направлению**|**Примечание**|
| - | - | - | - | - | - | - |
|1|Дом|12.11|21:00|Сдача лабораторной работы|интернет||


10. **Замечания автора по существу работы:** 
10. **Выводы:** 

Благодаря лабораторной работе были изучены структуры в языке Си. По сути они заменяют огромное количество условий (if else) и помогают разбить программу на некоторые отдельные части, из-за чего гораздо удобнее воспринимать код программы.  

Недочёты при выполнении задания могут быть выполнены следующим образом:

Подпись студета: 
